app/controllers/portfolios_controller.rb

    def create
        @portfolio_item = Portfolio.new(portfolio_params)

        respond_to do |format|
            if @portfolio_item.save
---
INSERT INTO "portfolios" ("title", "sub_title", "body", "main_img", "thamb_img", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)

    def update
        @portfolio_item = Portfolio.find(params[:id])
---
SELECT "portfolios".* FROM "portfolios" WHERE "portfolios"."id" = ? LIMIT ?  [["id", 10], ["LIMIT", 1]]

    def destroy
        @portfolio_item = Portfolio.find(params[:id])
        @portfolio_item.destroy
---
SELECT "portfolios".* FROM "portfolios" WHERE "portfolios"."id" = ? LIMIT ?  [["id", 17], ["LIMIT", 1]]
DELETE FROM "portfolios" WHERE "portfolios"."id" = ?  [["id", 17]]